In [1]:
import pandas as pd

In [2]:
## create dataframe -->>
df = pd.DataFrame({
    "Name": ["vikas","Yuvraj","Shlok","Ravi"],
    "Age": [21,23,34,32],
    "CGPA": [9.21, 8.23, 8.11, 9.01]
})

In [3]:
df

     Name  Age  CGPA
0   vikas   21  9.21
1  Yuvraj   23  8.23
2   Shlok   34  8.11
3    Ravi   32  9.01

In [4]:
## labels of dataframes -->> 
print(f"Labels for rows : {df.index}") 
print(f"Labels for columns : {df.columns}")

Labels for rows : RangeIndex(start=0, stop=4, step=1)
Labels for columns : Index(['Name', 'Age', 'CGPA'], dtype='object')

In [5]:
## creating dataframe from list of list -->>
df = pd.DataFrame([["Vikas",21],["Ravi",23]], columns = ["Name", "Age"])
df

    Name  Age
0  Vikas   21
1   Ravi   23

In [6]:
## Reading csv, json, excel files using pandas dataframes -->> we have to read the data and load the data into dataframes
csv_data = pd.read_csv("raw_data.csv")
print(f"csv data in the form of dataframe :\n{csv_data}")

## similarly for json and excel form data.

csv data in the form of dataframe :
    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [7]:
## Data Frame Methodos -->>
df = pd.DataFrame(csv_data)
df.head() #-->> print first 5 rows

   id          name   age country   gender   income
0   1      John Doe  29.0     USA     Male  55000.0
1   1      John Doe  29.0     USA     Male  55000.0
2   2    Jane Smith   NaN  Canada   Female  62000.0
3   3          Alex   NaN     USA  Unknown  47000.0
4   4  Maria Garcia  34.0   Spain   Female      NaN

In [8]:
df.tail()

    id         name   age country  gender   income
6    6          NaN  45.0   India  Female  73000.0
7    7   Ahmed Khan  38.0     NaN    Male  68000.0
8    8   Rachel Lee  29.0     USA  Female  62000.0
9    9  Carlos Ruiz   NaN  Mexico    Male  45000.0
10  10  Emily Davis  31.0     USA     NaN  58000.0

In [9]:
df.head(2)

   id      name   age country gender   income
0   1  John Doe  29.0     USA   Male  55000.0
1   1  John Doe  29.0     USA   Male  55000.0

In [10]:
df.tail(2)

    id         name   age country gender   income
9    9  Carlos Ruiz   NaN  Mexico   Male  45000.0
10  10  Emily Davis  31.0     USA    NaN  58000.0

In [11]:
df.sample()

   id  name  age country   gender   income
3   3  Alex  NaN     USA  Unknown  47000.0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       11 non-null     int64
 1   name     10 non-null     object
 2   age      8 non-null      float64
 3   country  10 non-null     object
 4   gender   10 non-null     object
 5   income   10 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 660.0+ bytes

In [13]:
df.describe()

              id        age        income
count  11.000000   8.000000     10.000000
mean    5.090909  32.750000  57600.000000
std     3.176619   6.065123   8896.940798
min     1.000000  27.000000  45000.000000
25%     2.500000  29.000000  52000.000000
50%     5.000000  30.000000  56500.000000
75%     7.500000  35.000000  62000.000000
max    10.000000  45.000000  73000.000000

In [14]:
df.nunique()

id         10
name        9
age         6
country     6
gender      3
income      8
dtype: int64

In [15]:
df.shape

(11, 6)

In [16]:
import pandas as pd

In [17]:
df = pd.Series("singhsapna03586@gmail.com")

In [18]:
df

0    singhsapna03586@gmail.com
dtype: object

In [19]:
df2 = df.str.split("@")

In [21]:
print(df2)

0    [singhsapna03586, gmail.com]
dtype: object